; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v6 - type_2 ?v7 - type_3)
 	      (pred_2 ?v8 - object ?v7 - type_3)
	      (pred_4 ?v6 - type_2 ?v5 - type_1)
	      (pred_3 ?v6 - type_2 ?v8 - object ?v5 - type_1))

   (:action op_3
       :parameters  (?v6 - type_2 ?v3 ?v4 - type_3)
       :precondition (and  (pred_1 ?v6 ?v3))
       :effect (and  (pred_1 ?v6 ?v4)
		     (not (pred_1 ?v6 ?v3))))

   (:action op_1
       :parameters (?v6 - type_2 ?v1 - object ?v2 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_2 ?v1 ?v2) (pred_1 ?v6 ?v2) (pred_4 ?v6 ?v5))
       :effect (and (pred_3 ?v6 ?v1 ?v5)
		    (not (pred_2 ?v1 ?v2)) 
		    (not (pred_4 ?v6 ?v5))))

   (:action op_2
       :parameters (?v6 - type_2 ?v1 - object ?v2 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_3 ?v6 ?v1 ?v5) (pred_1 ?v6 ?v2))
       :effect (and (pred_2 ?v1 ?v2)
		    (pred_4 ?v6 ?v5)
		    (not (pred_3 ?v6 ?v1 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_06 obj_10 - type_2
obj_14 obj_11 obj_07 obj_12 - type_1
obj_09 obj_13 obj_05 obj_03 - type_3
obj_08 obj_01 obj_02 obj_04 - object)
(:init
(pred_1 obj_06 obj_09)
(pred_4 obj_06 obj_14)
(pred_4 obj_06 obj_11)
(pred_1 obj_10 obj_09)
(pred_4 obj_10 obj_07)
(pred_4 obj_10 obj_12)
(pred_2 obj_08 obj_03)
(pred_2 obj_01 obj_09)
(pred_2 obj_02 obj_03)
(pred_2 obj_04 obj_13)
)
(:goal
(and
(pred_2 obj_08 obj_05)
(pred_2 obj_01 obj_03)
(pred_2 obj_02 obj_13)
(pred_2 obj_04 obj_05)
)
)

(:constraints
  (always (not (pred_1 obj_06 obj_05)))
)
)

; plan
1. (op_1 obj_06 obj_01 obj_09 obj_11)
   deleted: (pred_2 obj_01 obj_09) (pred_4 obj_06 obj_11)
   added: (pred_3 obj_06 obj_01 obj_11)
   goals met: 0 of 4
2. (op_3 obj_10 obj_09 obj_03)
   deleted: (pred_1 obj_10 obj_09)
   added: (pred_1 obj_10 obj_03)
   goals met: 0 of 4
3. (op_3 obj_06 obj_09 obj_03)
   deleted: (pred_1 obj_06 obj_09)
   added: (pred_1 obj_06 obj_03)
   goals met: 0 of 4
4. (op_1 obj_10 obj_02 obj_03 obj_12)
   deleted: (pred_2 obj_02 obj_03) (pred_4 obj_10 obj_12)
   added: (pred_3 obj_10 obj_02 obj_12)
   goals met: 0 of 4
5. (op_2 obj_06 obj_01 obj_03 obj_11)
   deleted: (pred_3 obj_06 obj_01 obj_11)
   added: (pred_2 obj_01 obj_03) (pred_4 obj_06 obj_11)
   goals met: 1 of 4
6. (op_3 obj_10 obj_03 obj_13)
   deleted: (pred_1 obj_10 obj_03)
   added: (pred_1 obj_10 obj_13)
   goals met: 1 of 4
7. (op_1 obj_06 obj_08 obj_03 obj_14)
   deleted: (pred_2 obj_08 obj_03) (pred_4 obj_06 obj_14)
   added: (pred_3 obj_06 obj_08 obj_14)
   goals met: 1 of 4
8. (op_2 obj_10 obj_02 obj_13 obj_12)
   deleted: (pred_3 obj_10 obj_02 obj_12)
   added: (pred_2 obj_02 obj_13) (pred_4 obj_10 obj_12)
   goals met: 2 of 4
9. (op_1 obj_10 obj_04 obj_13 obj_07)
   deleted: (pred_2 obj_04 obj_13) (pred_4 obj_10 obj_07)
   added: (pred_3 obj_10 obj_04 obj_07)
   goals met: 2 of 4
10. (op_2 obj_06 obj_08 obj_03 obj_14)
   deleted: (pred_3 obj_06 obj_08 obj_14)
   added: (pred_2 obj_08 obj_03) (pred_4 obj_06 obj_14)
   goals met: 2 of 4
11. (op_3 obj_10 obj_13 obj_05)
   deleted: (pred_1 obj_10 obj_13)
   added: (pred_1 obj_10 obj_05)
   goals met: 2 of 4
12. (op_2 obj_10 obj_04 obj_05 obj_07)
   deleted: (pred_3 obj_10 obj_04 obj_07)
   added: (pred_2 obj_04 obj_05) (pred_4 obj_10 obj_07)
   goals met: 3 of 4
13. (op_3 obj_10 obj_05 obj_03)
   deleted: (pred_1 obj_10 obj_05)
   added: (pred_1 obj_10 obj_03)
   goals met: 3 of 4
14. (op_1 obj_10 obj_08 obj_03 obj_12)
   deleted: (pred_2 obj_08 obj_03) (pred_4 obj_10 obj_12)
   added: (pred_3 obj_10 obj_08 obj_12)
   goals met: 3 of 4
15. (op_3 obj_10 obj_03 obj_05)
   deleted: (pred_1 obj_10 obj_03)
   added: (pred_1 obj_10 obj_05)
   goals met: 3 of 4
16. (op_2 obj_10 obj_08 obj_05 obj_12)
   deleted: (pred_3 obj_10 obj_08 obj_12)
   added: (pred_2 obj_08 obj_05) (pred_4 obj_10 obj_12)
   goals met: 4 of 4
